print('Lesson_3')                   # печатаем название задания
name = 'Nikolay'                    # создаём переменную строкового типа
print('Name:',name, type(name))     # печатаем значение переменной и её тип
age = 44                            # создаём переменную целочисленного типа
print('Age:',age, type(age))        # печатаем значение переменной и её тип
age = age + 1                       # увеличиваем значение переменно на единицу
print('New Age:',age, type(age))    # печатаем значение переменной и её тип
age += 1                            # увеличиваем значение переменной на единицу
print('New Age:',age, type(age))    # печатаем значение переменной и её тип
is_student = True                   # создаём переменную логического типа

# печатаем значение переменной и её тип
print('Is Student:',is_student, type(is_student))